# Шаг 1. Импортируйте необходимые библиотеки

In [2]:
import numpy as np
import pandas as pd

# Шаг 2. Импортируйте набор данных с этого [адреса](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

In [3]:
#в pandas можно напрямую передавать URL в функцию read_csv

# Шаг 3. Сохраните его в переменной с именем baby_names.

In [4]:
df = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

# Шаг 4. Выведите первые 10 строк

In [5]:
df.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

# Шаг 5.  Удалить столбцы 'Unnamed: 0' и 'Id'.

In [6]:
df.drop('Unnamed: 0', axis=1, inplace=True)
df.drop('Id', axis=1, inplace=True)
df.head(10)

       Name  Year Gender State  Count
0      Emma  2004      F    AK     62
1   Madison  2004      F    AK     48
2    Hannah  2004      F    AK     46
3     Grace  2004      F    AK     44
4     Emily  2004      F    AK     41
5   Abigail  2004      F    AK     37
6    Olivia  2004      F    AK     33
7  Isabella  2004      F    AK     30
8    Alyssa  2004      F    AK     29
9    Sophia  2004      F    AK     28

# Шаг 6. В наборе данных больше женских или мужских имен?

In [7]:
df['Gender'].value_counts().idxmax()

'F'

# Шаг 7.  Какое имя встречается чаще всего?

In [8]:
df['Name'].value_counts().idxmax()

'Riley'

# Шаг 8.  Сколько разных имен есть в наборе данных?

In [12]:
len(df['Name'].value_counts())

17632